#########################################################
# ይሄ የ ምሳሌ ፕሮግራም አራቱን የ ሂሳብ ስሌቶች ለመስራት ያስችላል###
# ደራሲ አብርሃም አዲሴ
#######################################################

ውጤት = 0
ላይሳለ እውነተኛ :
  እትም("የ ሂሳብ አይነቱን ምረት : ")
  ሂሳብአይነቱ = ግቤት("->")
  እትም("የ መጀመርያ ቁጠሩን አስገቡ : ")
  መጀመርያቁጥር = ኢንቲጀር (ግቤት ("->"))
  እትም("የ ሁለተኛ ቁጠሩን አስገቡ : ")
  ሁለተኛቁጥር = ኢንቲጀር (ግቤት ("->"))
  ከሆነ ሂሳብአይነቱ == '+':
    ውጤት = መጀመርያቁጥር + ሁለተኛቁጥር
  ሌላከሆነ ሂሳብአይነቱ == '-':
    ውጤት = መጀመርያቁጥር - ሁለተኛቁጥር
  ሌላከሆነ ሂሳብአይነቱ == '*':
    ውጤት = መጀመርያቁጥር * ሁለተኛቁጥር
  ሌላከሆነ ሂሳብአይነቱ == '/':
    ውጤት = መጀመርያቁጥር / ሁለተኛቁጥር
  ያለዚያ :
    እረፍት
  እትም ("ውጤት:" + ክር (ውጤት))
